/*
  УСЛОВИЕ:
  Определить тип каждого узла в бинарном дереве (таблица BST):
  - 'Root'  — главный узел (нет родителя P).
  - 'Inner' — промежуточный узел (есть и родитель, и дети).
  - 'Leaf'  — конечный узел (есть родитель, но нет детей).
  Результат отсортировать по номеру узла (N).
  N (Node) — сам узел (число).
  P (Parent) — узел-родитель, который стоит над узлом N.
*/
SELECT N, 
       CASE 
           WHEN P IS NULL THEN 'Root'
           WHEN N IN (SELECT P FROM BST) THEN 'Inner'
           ELSE 'Leaf'
       END
FROM BST
ORDER BY N;
